ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.c
/***************************************************************************//**
* \file cy_sysclk.c
* \version 1.0
*
* Provides an API implementation of the sysclk driver.
*
********************************************************************************
* \copyright
* Copyright 2016, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_sysclk.h"
#include "syslib/cy_syslib.h"
#include <math.h>
#include <stdlib.h>

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/* # of elements in an array */
#define  CY_SYSCLK_N_ELMTS(a)  (sizeof(a) / sizeof((a)[0]))

/* ========================================================================== */
/* ===========================    ECO SECTION    ============================ */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_EcoConfigure
****************************************************************************//**
*
* This function configures the external crystal oscillator (ECO) trim bits based
* on crystal characteristics. This function should only be called when the ECO is
* disabled.
*
* \param freq Operating frequency of the crystal in Hz.
*
* \param cLoad Crystal load capacitance in pF.
*
* \param esr Effective series resistance of the crystal in ohms.
*
* \param driveLevel Crystal drive level in uW.
*
* \return Error / status code:<br>
* CY_SYSCLK_SUCCESS - ECO configuration completed successfully<br>
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters<br>
* CY_SYSCLK_INVALID_STATE - ECO already enabled
*
* \note
* The following calculations are implemented, generally in floating point:
*   freqMHz = freq / 1,000,000
*   max amplitude Vpp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*   gm_min mA/V = 5 * 4 * 3.14 * 3.14 * freqMhz^2 * cLoad^2 * 4 * esr / 1,000,000,000
*   # amplifier sections = INT(gm_min / 4.5)
*   atrim = if max amplitude < 0.5 then error
*           else 2 * the following:
*                    max amplitude < 0.6: 0
*                    max amplitude < 0.7: 1
*                    max amplitude < 0.8: 2
*                    max amplitude < 0.9: 3
*                    max amplitude < 1.15: 5
*                    max amplitude < 1.275: 6
*                    max amplitude >= 1.275: 7
*   wdtrim = if max amplitude < 0.5 then error
*            else 2 * the following:
*                     max amplitude < 1.2: INT(5 * max amplitude) - 2
*                     max amplitude >= 1.2: 3
*   gtrim = if # amplifier sections > 3 then error
*           else the following:
*                # amplifier sections > 1: # amplifier sections
*                # amplifier sections = 1: 0
*                # amplifier sections < 1: 1
*   rtrim = if gtrim = error then error
*           else the following:
*                freqMHz > 26.8: 0
*                freqMHz > 23.33: 1
*                freqMHz > 16.5: 2
*                freqMHz <= 16.5: 3
*   ftrim = if atrim = error then error
*           else INT(atrim / 2)
*
* \note
* This function returns immediately if the ECO is enabled.
*******************************************************************************/
uint32_t Cy_SysClk_EcoConfigure(uint32_t freq, uint32_t cLoad, uint32_t esr, uint32_t driveLevel)
{
    /* error if ECO is not disabled - any of the 3 enable bits are set */
    uint32_t rtnval = CY_SYSCLK_INVALID_STATE;
    if ((SRSS->CLK_ECO_CONFIG & 0xE0000000ul) == 0ul)
    {
        /* calculate intemediate values */
        float32_t freqMHz = (float32_t)freq / 1000000.0f;
        float32_t maxAmplitude =
            (1000.0f * ((float32_t)sqrt((float64_t)((float32_t)driveLevel / (2.0f * (float32_t)esr))))) /
            (3.14f * freqMHz * (float32_t)cLoad);
        float32_t gm_min =
            (788.8f /*5 * 4 * 3.14 * 3.14 * 4*/ * freqMHz * freqMHz * (float32_t)cLoad * (float32_t)cLoad) /
            1000000000.0f;
        uint32_t nAmpSections = (uint32_t)(gm_min / 4.5f);

        /* error if input parameters cause erroneous intermediate values */
        rtnval = CY_SYSCLK_BAD_PARAM;
        if ((maxAmplitude >= 0.5f) && (nAmpSections <= 3ul))
        {
            uint32_t atrim, wdtrim, gtrim, rtrim, ftrim, reg;

            atrim = 2ul * (maxAmplitude < 0.6f ? 0ul :
                           (maxAmplitude < 0.7f ? 1ul :
                            (maxAmplitude < 0.8f ? 2ul :
                             (maxAmplitude < 0.9f ? 3ul :
                              (maxAmplitude < 1.15f ? 5ul :
                               (maxAmplitude < 1.275f ? 6ul : 7ul))))));

            wdtrim = 2ul * (maxAmplitude < 1.2f ? (uint32_t)(5.0f * maxAmplitude) - 2ul : 3ul);

            gtrim = (nAmpSections > 1ul ? nAmpSections :
                     (nAmpSections == 1ul ? 0ul : 1ul));

            rtrim = (freqMHz > 26.8f ? 0ul :
                     (freqMHz > 23.33f ? 1ul :
                      (freqMHz > 16.5f ? 2ul : 3ul)));

            ftrim = atrim / 2ul;

            /* update all fields of trim control register with one write, without
               changing the ITRIM field in bits [21:16]:
                 gtrim:  bits [13:12]
                 rtrim:  bits [11:10]
                 ftrim:  bits  [9:8]
                 atrim:  bits  [7:4]
                 wdtrim: bits  [2:0]
            */
            reg = (SRSS->CLK_TRIM_ECO_CTL & ~0x3FFFul);
            reg |= (gtrim  & 3ul)    << 12;
            reg |= (rtrim  & 3ul)    << 10;
            reg |= (ftrim  & 3ul)    << 8;
            reg |= (atrim  & 0x0Ful) << 4;
            reg |= (wdtrim & 7ul);
            SRSS->CLK_TRIM_ECO_CTL = reg;

            rtnval = CY_SYSCLK_SUCCESS;
        } /* if valid parameters */
    } /* if ECO not enabled */

    return (rtnval);
}

