ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.c
            config.outputMode = outputMode;
            /* TRM step 1a,b. Determine if output division by 2 is required. */
            config.enableOutputDiv = (bool)((outputFreq < CY_SYSCLK_MIN_FLL_CCO_OUTPUT_FREQ) ? 1ul : 0ul);
            /* TRM step 1c. Compute the CCO frequency from the output division. */
            ccoFreq = outputFreq * ((uint32_t)(config.enableOutputDiv) + 1ul);
            /* TRM step 1d,e. Compute the CCO range value from the CCO frequency */
            config.ccoRange = (ccoFreq >= 150000000ul ? CY_SYSCLK_FLL_CCO_RANGE4 :
                               (ccoFreq >= 113000000ul ? CY_SYSCLK_FLL_CCO_RANGE3 :
                                (ccoFreq >=  85000000ul ? CY_SYSCLK_FLL_CCO_RANGE2 :
                                 (ccoFreq >=  64000000ul ? CY_SYSCLK_FLL_CCO_RANGE1 : CY_SYSCLK_FLL_CCO_RANGE0))));
            /* TRM step 3. Compute the FLL reference divider value.
                      Formula is REF_DIV = (1 / precision) * (inputFreq / ccoFreq)
                      Precision is assumed to be 0.0553%.
                      Therefore REF_DIV = 1808.019 * inputFreq / ccoFreq
                      Result is rounded up. */
            config.refDiv = (uint32_t)ceilf((1808.019f * (float32_t)inputFreq) / (float32_t)ccoFreq);
            /* TRM step 4. Set the lock tolerance.
                      Output frequency accuracy = precision * lock tolerance.
                      Generally a value of 5 is acceptable. */
            config.lockTolerance = 20ul;
            /* TRM step 5. Compute the FLL MULT value. Note that we can't integer multiply
                  ccoFreq * refDiv because it may overflow a 32-bit integer. */
            config.fllMult = CY_SYSCLK_DIV_ROUND(ccoFreq, CY_SYSCLK_DIV_ROUND(inputFreq, config.refDiv));
            /* TRM step 6. Calculate the settling count, using a 1-usec settling time. */
            config.settlingCount = CY_SYSCLK_DIV_ROUNDUP(inputFreq * CY_SYSCLK_FLL_CCO_SETTLING_TIME, 1000000ul);
            /* TRM step 7. Calculate the CCO igain and pgain. */
            {
                /* CCO gain values based on CCO_RANGE bitfield values */
                const float32_t kCco[] = {46.17112083f, 61.42259619f, 81.71201510f, 108.70353626f, 144.61103156f};

                /* igain and pgain bitfield values correspond to: 1/256, 1/128, ..., 4, 8 */
                const float32_t gains[] = {0.00390625f, 0.0078125f, 0.015625f, 0.03125f, 0.0625f, 0.125f, 0.25f,
                                       0.5f, 1.0f, 2.0f, 4.0f, 8.0f};

                float32_t temp = 0.9f / ((float32_t)(kCco[config.ccoRange] * ((float32_t) config.refDiv / ((float32_t)inputFreq / 1000.0f) )));

                /* find the largest IGAIN value that is less than kCCO * refDiv /inputFreq */
                for(config.igain = CY_SYSCLK_N_ELMTS(gains) - 1ul;
                    (gains[config.igain] >= temp) && (config.igain != 0ul);
                    config.igain--){}
                /* then find the largest PGAIN value such that (IGAIN + PGAIN) is less than
                   kCCO * refDiv /inputFreq */
                for(config.pgain = CY_SYSCLK_N_ELMTS(gains) - 1ul;
                    ((gains[config.igain] + gains[config.pgain]) >= temp) && (config.pgain != 0ul);
                    config.pgain--){}
                /* final check for exceeding limit; adjust IGAIN and PGAIN downward if needed. */
                while(((gains[config.igain] + gains[config.pgain]) >= temp) &&
                      ((config.igain != 0ul) || (config.pgain != 0ul)))
                {
                    if (config.igain != 0ul)
                    {
                        config.igain--;
                    }
                    else if (config.pgain != 0ul)
                    {
                        config.pgain--;
                    }
                    else /* both are zero; exit loop; done the best we can */
                    {
                    }
                }
            }

            /* configure FLL based on calculated values */
            returnStatus = Cy_SysClk_FllManualConfigure(&config);
        } /* if not bypass output mode */

        else
        { /* bypass mode */
            /* update CLK_FLL_CONFIG3 register with divide by 2 parameter */
            CY_SYSCLK_CLR_SET(SRSS->CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, (uint32_t)outputMode);
        }
    } /* if no error */

    return (returnStatus);
}

/*******************************************************************************
* Function Name: Cy_SysClk_FllManualConfigure
****************************************************************************//**
*
* Manually configures the FLL based on user inputs.
*
* \param config \ref cy_stc_fll_manual_config_t
*
* \return  Error / status code:<br>
* CY_SYSCLK_SUCCESS - FLL successfully configured<br>
* CY_SYSCLK_INVALID_STATE - FLL not configured because it is enabled
*
* \note
* Do not call this function when the FLL is enabled. If it is, then this function
* returns immediately with an error return value and no register updates.
*******************************************************************************/
uint32_t Cy_SysClk_FllManualConfigure(const cy_stc_fll_manual_config_t *config)
{
    uint32_t returnStatus = CY_SYSCLK_SUCCESS;

    /* check for errors */
    if (_FLD2VAL(SRSS_CLK_FLL_CONFIG_FLL_ENABLE, SRSS->CLK_FLL_CONFIG) != 0u) /* 1 = enabled */
    {
        returnStatus = CY_SYSCLK_INVALID_STATE;
    }
    else
    { /* return status is OK */
    }

    /* no error */
    if (returnStatus == CY_SYSCLK_SUCCESS) /* no errors */
    {
        /* update CLK_FLL_CONFIG register with 2 parameters; FLL_ENABLE is already 0 */
        uint32_t reg = _VAL2FLD(SRSS_CLK_FLL_CONFIG_FLL_MULT, config->fllMult);
        SRSS->CLK_FLL_CONFIG = reg | _VAL2FLD(SRSS_CLK_FLL_CONFIG_FLL_OUTPUT_DIV, (uint32_t)(config->enableOutputDiv));
        /* update CLK_FLL_CONFIG2 register with 2 parameters */
        reg = _VAL2FLD(SRSS_CLK_FLL_CONFIG2_FLL_REF_DIV, config->refDiv);
        SRSS->CLK_FLL_CONFIG2 = reg | _VAL2FLD(SRSS_CLK_FLL_CONFIG2_LOCK_TOL, config->lockTolerance);
        /* update CLK_FLL_CONFIG3 register with 4 parameters */
        reg  = _VAL2FLD(SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN, config->igain);
        reg |= _VAL2FLD(SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN, config->pgain);
        reg |= _VAL2FLD(SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT, config->settlingCount);
        SRSS->CLK_FLL_CONFIG3 = reg | _VAL2FLD(SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, (uint32_t)(config->outputMode));
        /* update CLK_FLL_CONFIG4 register with 1 parameter; preserve other bits */
        CY_SYSCLK_CLR_SET(SRSS->CLK_FLL_CONFIG4, SRSS_CLK_FLL_CONFIG4_CCO_RANGE, (uint32_t)(config->ccoRange));
    } /* if no error */

    return (returnStatus);
}

