ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.c
            rtnval = CY_SYSCLK_SUCCESS;
        } /* if (clock1 < CY_SYSCLK_MEAS_CLK_LAST_CLK && clock2 < CY_SYSCLK_MEAS_CLK_LAST_CLK) */
    } /* if (not done) */
    return (rtnval);
}

/*******************************************************************************
* Function Name: Cy_SysClk_StartClkMeasurementCounters
****************************************************************************//**
*
* Starts the calibration counters.
*
* \return Error / status code:<br>
* CY_SYSCLK_INVALID_STATE if already doing a measurement<br>
* else CY_SYSCLK_SUCCESS
*
* \note Cy_SysClk_InitClkMeasurementCounters() must have been called previously.
*******************************************************************************/
uint32_t Cy_SysClk_StartClkMeasurementCounters(void)
{
    uint32_t rtnval = CY_SYSCLK_INVALID_STATE;
    if (_FLD2VAL(SRSS_CLK_CAL_CNT1_CAL_COUNTER_DONE, SRSS->CLK_CAL_CNT1) != 0ul/*1 = done*/)
    {
        /* Counting starts when this register is written with a nonzero value. */
        SRSS->CLK_CAL_CNT1 = clk1Count1;
        rtnval = CY_SYSCLK_SUCCESS;
    }
    return (rtnval);
}

/*******************************************************************************
* Function Name: Cy_SysClk_ClkMeasurementCountersGetClock2Freq
****************************************************************************//**
*
* Returns the frequency of clock 2 in Hz. The following equation is used:
* clock2 frequency = (count2/count1) * clock1 frequency
*
* \return Frequency of clock 2 in Hz
*
* \note This must only be called if the counters are done.
*******************************************************************************/
uint32_t Cy_SysClk_ClkMeasurementCountersGetClock2Freq(void)
{
    return (uint32_t)
        CY_SYSCLK_DIV_ROUND((uint64_t)_FLD2VAL(SRSS_CLK_CAL_CNT2_CAL_COUNTER2, SRSS->CLK_CAL_CNT2) * clk1FregHz, clk1Count1);
}

/* ========================================================================== */
/* ==========================    TRIM SECTION    ============================ */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_IloTrim
****************************************************************************//**
*
* Trims the ILO to be as close to 32,768 Hz as possible. The clock measurement
* counters should be used to obtain the current frequency of the ILO. This
* frequency should then be passed into this function. This function will then
* use this information to trim the ILO as close as possible to 32,768 Hz.
*
* \param iloFreq current ILO frequency as measured by the measurement counters
*
* \return The achieved ILO frequency in Hz
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*******************************************************************************/
/* target frequency */
#define CY_SYSCLK_ILO_TARGET_FREQ  32768u

uint32_t Cy_SysClk_IloTrim(uint32_t iloFreq)
{
    /* Nominal trim step size is 1.5% of "the frequency". Using the target frequency. */
    const uint32_t trimStep = CY_SYSCLK_DIV_ROUND((uint32_t)CY_SYSCLK_ILO_TARGET_FREQ * 15ul, 1000ul);
    /* Get the current trim value, and adjust it up or down the appropriate
       number of steps. Calculate the new frequency. */
    uint32_t newTrim;
    uint32_t newFreq;
    uint32_t curTrim = _FLD2VAL(SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM, SRSS->CLK_TRIM_ILO_CTL);
    if (iloFreq > CY_SYSCLK_ILO_TARGET_FREQ)
    { /* reduce the trim value; calculate new frequency */
        newTrim = curTrim - CY_SYSCLK_DIV_ROUND(iloFreq - CY_SYSCLK_ILO_TARGET_FREQ, trimStep);
        newFreq = iloFreq - (trimStep * (curTrim - newTrim));
    }
    else
    { /* iloFreq too low. Increase the trim value; calculate new frequency. */
        newTrim = curTrim + CY_SYSCLK_DIV_ROUND(CY_SYSCLK_ILO_TARGET_FREQ - iloFreq, trimStep);
        newFreq = iloFreq + (trimStep * (newTrim - curTrim));
    }

    /* Update the trim value */
    CY_SYSCLK_CLR_SET(SRSS->CLK_TRIM_ILO_CTL, SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM, newTrim);

    return newFreq;
}

/*******************************************************************************
* Function Name: Cy_SysClk_PiloTrim
****************************************************************************//**
*
* Trims the PILO to be as close to 32,768 Hz as possible. The clock measurement
* counters should be used to obtain the current frequency of the PILO. This
* frequency should then be passed into this function. This function will then
* use this information to trim the PILO as close as possible to 32,768Hz.
*
* \param piloFreq current PILO frequency as measured by the measurement counters
*
* \return The achieved PILO frequency in Hz
*
*******************************************************************************/
/* target frequency */
#define CY_SYSCLK_PILO_TARGET_FREQ  32768u
/* nominal trim step size */
#define CY_SYSCLK_PILO_TRIM_STEP 1000u

uint32_t Cy_SysClk_PiloTrim(uint32_t piloFreq)
{
    /* Get the current trim value, and adjust it up or down the appropriate
       number of steps. Calculate the new frequency. */
    uint32_t newTrim;
    uint32_t newFreq;
    uint32_t curTrim = _FLD2VAL(SRSS_CLK_TRIM_PILO_CTL_PILO_CFREQ, SRSS->CLK_TRIM_PILO_CTL);
    if (piloFreq > CY_SYSCLK_PILO_TARGET_FREQ)
    { /* reduce the trim value; calculate new frequency */
        newTrim = curTrim - CY_SYSCLK_DIV_ROUND(piloFreq - CY_SYSCLK_PILO_TARGET_FREQ, CY_SYSCLK_PILO_TRIM_STEP);
        newFreq = piloFreq - (CY_SYSCLK_PILO_TRIM_STEP * (curTrim - newTrim));
    }
    else
    { /* piloFreq too low. Increase the trim value; calculate new frequency. */
        newTrim = curTrim + CY_SYSCLK_DIV_ROUND(CY_SYSCLK_PILO_TARGET_FREQ - piloFreq, CY_SYSCLK_PILO_TRIM_STEP);
        newFreq = piloFreq + (CY_SYSCLK_PILO_TRIM_STEP * (newTrim - curTrim));
    }

    /* Update the trim value */
    CY_SYSCLK_CLR_SET(SRSS->CLK_TRIM_PILO_CTL, SRSS_CLK_TRIM_PILO_CTL_PILO_CFREQ, newTrim);

    return newFreq;
}

/* ========================================================================== */
/* ===========================    WCO SECTION    ============================ */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_WcoConfigureCsv
****************************************************************************//**
*
* Configure the WCO clock supervisor (CSV).
*
* \param config \ref cy_stc_wco_csv_config_t
*
* \note
* If loss detection is enabled, writes to other register bits are ignored.
* Therefore loss detection is disabled before writing the config structure
* members to the CTL register. Note that one of the config structure members is
* an enable bit.
*******************************************************************************/
void Cy_SysClk_WcoConfigureCsv(const cy_stc_wco_csv_config_t *config)
{
  #if SRSS_WCOCSV_PRESENT != 0
    /* First clear all bits, including the enable bit; disable loss detection. */
    SRSS->CLK_CSV_WCO_CTL = 0ul;
    /* Then write the structure elements (which include an enable bit) to the register. */
    SRSS->CLK_CSV_WCO_CTL = _VAL2FLD(SRSS_CLK_CSV_WCO_CTL_CSV_MUX, (uint32_t)config->SupervisorClock)      |
                            _VAL2FLD(SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_WINDOW, (uint32_t)(config->LossWindow)) |
                            _VAL2FLD(SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_ACTION, (uint32_t)(config->LossAction)) |
                            _VAL2FLD(SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_EN, config->enableLossDetection);
  #endif /* SRSS_WCOCSV_PRESENT != 0 */
}


/* ========================================================================== */
/* ========================    clk_hf[n] SECTION    ========================= */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_HfClockConfigureCsv
****************************************************************************//**
*
* Configures the ClkHf clock supervisor (CSV).
*
* \param hfClk selects which ClkHf CSV to configure.
*
* \param config \ref cy_stc_hf_csv_config_t
*
* \note
* If loss detection is enabled, writes to other register bits are ignored.
* Therefore loss detection is disabled before writing the config structure
* members to the CTL register. Note that one of the config structure members is
* an enable bit.
*******************************************************************************/
void Cy_SysClk_HfClockConfigureCsv(uint32_t hfClk, const cy_stc_hf_csv_config_t *config)
{
  #if SRSS_MASK_HFCSV != 0
    /* First update the limit bits; this can be done regardless of enable state. */
    SRSS->CLK_CSV[hfClk].HF_LIMIT = _VAL2FLD(CLK_CSV_HF_LIMIT_UPPER_LIMIT, config->FrequencyUpperLimit) |
                                    _VAL2FLD(CLK_CSV_HF_LIMIT_LOWER_LIMIT, config->FrequencyLowerLimit);
    /* Then clear all CTL register bits, including the enable bit; disable loss detection. */
    SRSS->CLK_CSV[hfClk].HF_CTL = 0ul;
    /* Finally, write the structure elements (which include an enable bit) to the CTL register. */
    SRSS->CLK_CSV[hfClk].HF_CTL = _VAL2FLD(CLK_CSV_HF_CTL_CSV_LOSS_EN, config->enableLossDetection)             |
                                  _VAL2FLD(CLK_CSV_HF_CTL_CSV_LOSS_ACTION, (uint32_t)(config->LossAction))      |
                                  _VAL2FLD(CLK_CSV_HF_CTL_CSV_FREQ_EN, config->enableFrquencyFaultDetection)    |
                                  _VAL2FLD(CLK_CSV_HF_CTL_CSV_FREQ_ACTION, (uint32_t)(config->FrequencyAction)) |
                                  _VAL2FLD(CLK_CSV_HF_CTL_CSV_LOSS_WINDOW, (uint32_t)(config->LossWindow))      |
                                  _VAL2FLD(CLK_CSV_HF_CTL_CSV_MUX, (uint32_t)(config->SupervisorClock))         |
                                  _VAL2FLD(CLK_CSV_HF_CTL_CSV_FREQ_WINDOW, config->SupervisingWindow);
  #endif /* SRSS_MASK_HFCSV != 0 */
}

/* ========================================================================== */
/* ========================    clk_peri SECTION    ========================== */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetFrequency
****************************************************************************//**
*
* Reports the frequency of the output of a given peripheral divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \return The frequency, in Hz
*
* \note
* The reported frequency may be zero, which indicates unknown. This happens if
* the source input is clk_ext, ECO, clk_althf, dsi_out, or clk_altlf.
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_divider_types_t dividerType, uint32_t dividerNum)
{
    uint32_t rtnval = 0ul; /* 0 = unknown frequency */

